app/views/posts/index.html.erb

                </p>
                <p><span class="glyphicon glyphicon-time">Created at</span> <%= Post.last.created_at.strftime("%m-%d-%Y %H:%M") %></p>
---
SELECT "posts".* FROM "posts"   ORDER BY "posts"."created_at" DESC