app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("comments", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comments", ""], ["created_at", "2016-02-14 18:57:29.421691"], ["email", ""], ["name", ""], ["updated_at", "2016-02-14 18:57:29.421691"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save