app/controllers/hospitals_controller.rb

SELECT "hospitals".* FROM "hospitals"
---
    def index
        @hospitals = Hospital.all

SELECT  "hospitals".* FROM "hospitals"  WHERE "hospitals"."id" = ? LIMIT 1  [["id", 1]]
---
   def show
        @hospital = Hospital.find( params[:id])

SELECT  "hospitals".* FROM "hospitals"  WHERE "hospitals"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        @hospital = Hospital.find(params[:id])

SELECT  "hospitals".* FROM "hospitals"  WHERE "hospitals"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "hospitals" SET "address" = ?, "facility_contact" = ?, "oncall_number" = ?, "updated_at" = ? WHERE "hospitals"."id" = 2  [["address", "800 W 5th Ave, Spokane, WA 99204"], ["facility_contact", "Steve Sims"], ["oncall_number", "509-473-4357"], ["updated_at", "2016-02-19 18:44:13.258464"]]
---
    def update
        @hospital = Hospital.find( params[:id] )

        if @hospital.update_attributes(hospital_params)

INSERT INTO "hospitals" ("address", "as_400", "city", "created_at", "facility", "facility_contact", "images", "name", "network_diagram", "oncall_number", "phone_number", "site_code", "state", "updated_at", "wan_a", "wan_b", "zip_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        params.permit!

    @hospital = Hospital.new(params[:hospital])
    if @hospital.save