app/controllers/messages_controller.rb

  def create

    @conversation = Conversation.find(params[:conversation_id])
    @message = @conversation.messages.build(message_params)
    @message.user_id = current_user.id
    @message.save!
---
SELECT  "conversations".* FROM "conversations"  WHERE "conversations"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "messages" ("body", "conversation_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Hello you got a second?"], ["conversation_id", 1], ["created_at", "2016-02-13 21:56:50.228164"], ["updated_at", "2016-02-13 21:56:50.228164"], ["user_id", 2]]