app/controllers/pages_controller.rb

SELECT  "rights".* FROM "rights"  WHERE "rights"."id" = ? LIMIT 1  [["id", 1]]
---
    def index
        @basic_right = Right.find(1)