app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY "posts"."created_at" DESC
---
  def index
    @new_post = Post.new
    @posts = Post.order(created_at: :desc).all

SELECT "posts".* FROM "posts"
---
  def show
    @post = Post.all

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "test 5"], ["created_at", "2016-02-20 14:37:56.381836"], ["title", "test"], ["updated_at", "2016-02-20 14:37:56.381836"]]
---
  def create
 			@post = Post.create(post_params)