app/controllers/profiles_controller.rb

    def new
    # form where a user can fill out their own profile.
    @user = User.find( params[:user_id] )
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

    def create
        @user = User.find( params[:user_id])
        @profile = @user.build_profile(profile_params)
        if @profile.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 4  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "profiles" ("contact_email", "created_at", "description", "first_name", "job_title", "last_name", "location", "phone_number", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "profiles" SET "updated_at" = ?, "user_id" = ? WHERE "profiles"."id" = 1  [["updated_at", "2016-02-15 03:09:47.181666"], ["user_id", nil]]

    def edit
        @user = User.find( params[:user_id] )
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

    def update
        @user = User.find( params[:user_id] )
        @profile = @user.profile
        if @profile.update_attributes(profile_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "profiles" SET "job_title" = ?, "location" = ?, "updated_at" = ? WHERE "profiles"."id" = 2  [["job_title", "ECC"], ["location", "BDC"], ["updated_at", "2016-02-15 04:50:09.172737"]]